---
kind: other
id: Methods.T:Autodesk.Revit.DB.DetailNurbSpline
source: html/6e09a105-616b-f3e0-ca26-12d8cc73cc04.htm
---
# DetailNurbSpline Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.